Repository: wp-plugins/vkontakte-share-button
Catalog: lang/vk-share-button-*.po
Languages: ru_ru, uk

source: VKontakte Share Button Settings
ru_ru: Настройки кнопки публикации ВКонтакте
uk: Налаштування кнопки публікації вКонтакті

source: Button type
ru_ru: Тип кнопки
uk: Тип кнопки

source: Rounded corners with counter
ru_ru: Скругленные углы и счетчик
uk: Заокруглені кути і лічильник

source: Rounded corners without counter
ru_ru: Скругленные углы без счетчика
uk: Заокруглені кути без лічильника

source: Sharp corners with counter
ru_ru: Острые углы и счетчик
uk: Гострі кути і лічильник

source: Sharp corners without counter
ru_ru: Острые углы без счетчика
uk: Гострі кути без лічильника

source: Text link with icon
ru_ru: Текстовая ссылка со значком
uk: Текстове посилання зі значком

source: Text link without icon
ru_ru: Текстовая ссылка без значка
uk: Текстове посилання без значка

source: Custom
ru_ru: Свой дизайн
uk: Власний дизайн

source: Choose appearance of the button
ru_ru: Выберите внешний вид кнопки
uk: Оберіть зовнішній вигляд кнопки

source: Button horizontal position
ru_ru: Горизонтальная позиция кнопки
uk: Горизонтальне розміщення кнопки

source: Right
ru_ru: Справа
uk: Справа

source: Left
ru_ru: Слева
uk: Зліва

source: Select which side you want to display the button: right or left
ru_ru: Выберите, с какой стороны разместить кнопку: справа или слева
uk: Оберіть де розмістити кнопку: справа, зліва

source: Button vertical position
ru_ru: Вертикальная позиция кнопки
uk: Вертикальне розміщення кнопки

source: On top of post
ru_ru: Перед постом
uk: Перед публікацією

source: On bottom of post
ru_ru: После поста
uk: Після публікації

source: Sets up before or after post/page button are shown
ru_ru: После или перед постом отображается кнопка
uk: Після або перед публікацією показувати кнопку

source: Use own CSS
ru_ru: Использовать свой CSS
uk: Використати власний CSS

source: Enable
ru_ru: Разрешить
uk: Дозволити

source: Custom CSS
ru_ru: Свой CSS
uk: Власний CSS

source: CSS for div wraps the button. <strong>Notice</strong>, horizontal position option disabled with custom CSS. You sould take care of the button alignment, eg <code>float: right; margin: 0 0 5px 10px;</code> for the right position.
ru_ru: Стили CSS для div, окружающего кнопку. <strong>Обратите внимание</strong>, при использовании своего CSS горизонтальное позиционирование отключено. Вам следует самим позаботиться о выравнивании, например, так: <code>float: right; margin: 0 0 5px 10px;</code>, чтобы поместить кнопку справа.
uk: Стилі CSS для div, що обгортає кнопку. <strong>Зверніть увагу</strong>, при використанні власного CSS горизонтальне розміщенні вимкнене. Вам треба самому зробити таке вирівнювання, наприклад, так: <code>float: right; margin: 0 0 5px 10px;</code>, щоб розмістити кнопку справа.

source: The Button displays on
ru_ru: Показывать кнопку
uk: Показувати кнопку

source: Posts
ru_ru: В постах
uk: В публікаціях

source: Pages
ru_ru: На страницах
uk: На сторінках

source: Frontpage
ru_ru: На главной
uk: На головній

source: Category archives
ru_ru: В категориях
uk: В категоріях

source: Tag listing
ru_ru: В метках
uk: В теґах

source: Date-based archives
ru_ru: В архивах по дате
uk: В архівах по даті

source: Author archives
ru_ru: В архивах автора
uk: В архівах автора

source: Search results
ru_ru: В результатах поиска
uk: В результатах пошуку

source: Exclude pages and posts with IDs
ru_ru: Исключить страницы и записи с ID
uk: Виключити сторінки/публікації з такими ID

source: Specify IDs of pages and posts which should stay without buttons (separated by commas, eg <code>4, 8, 15, 16, 23, 42</code>)
ru_ru: Укажите ID страниц и записей, которые следует оставить без кнопок (разделяйте запятыми, например, <code>4, 8, 15, 16, 23, 42</code>)
uk: Вкажіть ID сторінок і публікацій, на яких слід прибрати кнопку (розділяйте комою, наприклад, <code>4, 8, 15, 16, 23, 42</code>)

source: Text on button
ru_ru: Текст на кнопке
uk: Текст на кнопці

source: Text are displayed on the button or html code for custom button type
ru_ru: Отображаемый на кнопке текст или html-код для своего дизайна
uk: Текст або html-код для власного дизайну

source: Description
ru_ru: Описание
uk: Опис

source: Auto
ru_ru: Авто
uk: Авто

source: Global
ru_ru: Глобальное
uk: Глобальний

source: None
ru_ru: Без описания
uk: Без опису

source: Page description. Auto - forepart of post. Global - your own custom description (the same for each page). None - no description (good if you use meta tag <code>description</code>)
ru_ru: Описание страницы. Авто - первая часть записи. Глобальное - свое описание, общее для всех страниц сайта. Без описания - описания нет (удобно, если вы используете мета-тег <code>description</code>)
uk: Опис сторінки. Авто — перша частина тексту. Глобальний — свій опис, загальний для всіх сторінок сайту. Без опису - опис відсутній (це зручно, коли Ви використовуєте мета-теґ <code>description</code>)

source: Custom description text
ru_ru: Текст глобального описания
uk: Текст глобального опису

source: Type global site description below
ru_ru: Введите глобальное описание
uk: Введіть глобальний опис

source: Auto description length
ru_ru: Длина авто-описания
uk: Довжина авто-опису

source: Default - first 350 characters of post
ru_ru: По-умолчанию, первые 350 символов записи
uk: Стандартно, перші 350 символів

source: Logo link
ru_ru: Ссылка на логотип
uk: Посилання на логотип

source: Link to thumbnail logo image, e.g. <code>http://your.site/vk.png</code>
ru_ru: Ссылка на небольшой логотип сайта, например, <code>http://your.site/vk.png</code>
uk: Посилання на невелике лого сайту, наприклад, <code>http://your.site/vk.png</code>

source: Additional API parsing request
ru_ru: Дополнительный API запрос к сайту
uk: Додатковий API запит до сайту

source: Disable
ru_ru: Запретить
uk: Заборонити

source: Allow VKontakte to send request for empty share button parameters. Useful if you use meta tag <code>description</code> or <code>&lt;link rel="image_src" href="http://mysite.com/mypic.jpg" /&gt;</code> for logo image
ru_ru: Позволяет сайту ВКонтакте отправлять запрос для определения дополнительных параметров кнопки публикации. Полезно, если вы используете мета-тег <code>description</code> или <code>&lt;link rel="image_src" href="http://mysite.com/mypic.jpg" /&gt;</code> для логотипа
uk: Дозволяє сайту вКонтакті надсилати запит для визначення додаткових параметрів кнопки публікації. Це корисно коли Ви використовуєте мета-теґ <code>description</code> або <code>&lt;link rel="image_src" href="http://mysite.com/mypic.jpg" /&gt;</code> для логотипу

source: Save Changes
ru_ru: Сохранить изменения
uk: Зберегти зміни

source: Also, you can use <code>[vk-share-button]</code> shortcode to place the buttons anywhere on your posts and pages. Remember to exclude a page with the shortcode to avoid a problems.
ru_ru: Так же вы можете использоваться код <code>[vk-share-button]</code> для размещения кнопки в любом месте Ваших записей и страниц. Не забудьте исключить страницу с кодом, чтобы избежать проблем.
uk: Ви також можете використати код <code>[vk-share-button]</code> для розміщення кнопки в будь-якому місці Ваших публікацій і сторінок. Не забудьте виключити сторінку з кодом, щоб уникнути проблем.

source: Like this plugin?
ru_ru: Нравится плагин?
uk: Подобається плаґін?

source: Why not do any of the following:
ru_ru: Почему бы тогда не:
uk: Чому б тоді не:

source: Link to it so other folks can find out about it.
ru_ru: Дать ссылку, чтобы другие люди узнали о нем;
uk: Дати посилання, щоб інші люди дізналися про нього.

source: <a href="http://wordpress.org/extend/plugins/vkontakte-share-button/">Give it a good rating</a> on WordPress.org.
ru_ru: <a href="http://wordpress.org/extend/plugins/vkontakte-share-button/">Поставить хорошую оценку</a> на WordPress.org.
uk: <a href="http://wordpress.org/extend/plugins/vkontakte-share-button/">Поставити хорошу оцінку</a> на WordPress.org.

source: Need support?
ru_ru: Нужна помощь?
uk: Потрібна допомога?

source: If you have any problems or good ideas, please talk about them in the <a href="http://wordpress.org/tags/vkontakte-share-button">Support forums</a> or <a href="http://wordpress.org/tags/vkontakte-share-button">Plugin page</a>.
ru_ru: Если у Вас есть какие-либо проблемы или хорошие идеи, пожалуйста, расскажите о них на <a href="http://wordpress.org/tags/vkontakte-share-button">форумах поддержки</a> или <a href="http://wordpress.org/tags/vkontakte-share-button">странице плагина</a>.
uk: Якщо у вас є ідеї, пропозиції, зауваження — можете поділитися ними на <a href="http://wordpress.org/tags/vkontakte-share-button">форумах підтримки</a> або на <a href="http://wordpress.org/tags/vkontakte-share-button">сторінці плаґіну</a>.

source: Support project
ru_ru: Поддержи проект
uk: Підтримайте проект

source: Donate Webmoney
ru_ru: Презентовать Webmoney
uk: Презентувати Webmoney

source: VKontakte share button plugin requires Wordpress 2.8 or newer. <a href="http://codex.wordpress.org/Upgrading_WordPress">Please update!</a>
ru_ru: Плагин кнопки публикации ВКонтакте требует Wordpress версии 2.8 или выше. <a href="http://codex.wordpress.org/Upgrading_WordPress">Пожалуйста, обновитесь!</a>
uk: Плаґін кнопки вКонтакті потребує WP 2.8+. <a href="http://codex.wordpress.org/Upgrading_WordPress">Оновіть WordPress!</a>

source: VKontakte Share Button Plugin Settings
ru_ru: Настройки плагина Кнопка публикации ВКонтакте
uk: Налаштування плаґіну кнопки публікації вКонтакті

source: VK Share Button
ru_ru: Кнопка ВКонтакте
uk: Кнопка вКонтакті

source: Class VKShareButton already declared!
ru_ru: Класс VKShareButton уже объявлен!
uk: Клас VKShareButton вже оголошено!
